//Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

Console.WriteLine("введите номер дня недели ");
string number1 = Console.ReadLine();
if(number1 == 1)
{
    Console.WriteLine("Понедельник")
}
